<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title></title>
</head>
<body>

<!--可变变量-->
<?php
//可变变量，就是变量的名字是可以使用"动态变化"来获取不同的数据值
$s1 = 'abc';
$abc = 10;
echo $$s1;

$v1 = 1;
$v2 = 12;
$v3 = 33;
$v4 = 44;
$v5 = 115;

$sum = 0;


//$i++ 与 ++$i的区别
//显示 ++$i的效率会更高
//原因是
/**
 * i++的流程是
 * j = i;
 * j +=1;
 * j=i
 */

/**
 * ++i的流程是
 * j =i+1; (明显少了一步，所以效率会高一点，部分的编译器会进行优化直接变为++i)
 * j=i
 */

for ($i = 1; $i <= 5; ++$i) {
    $v = "v" . $i;
    $sum += $$v;//这里记得是使用两个美元符号获取变量的真实值
}

echo "<br/> sum = {$sum}";

?>


</body>
</html>